const resources = [
  {
    "id": 1,
    "title": "國立臺灣大學學生選課流程極簡版簡介",
    "category": "學業類",
    "description": "臺大官方選課系統懶人包",
    "tags": [
      "官方",
      "新生",
      "選課"
    ],
    "source": "",
    "url": "https://www.aca.ntu.edu.tw/WebUPD/aca/UAADForms/%E5%AD%B8%E7%94%9F%E9%81%B8%E8%AA%B2%E6%B5%81%E7%A8%8B%E6%A5%B5%E7%B0%A1%E7%89%88%E7%B0%A1%E4%BB%8B.pdf"
  },
  {
    "id": 2,
    "title": "臺大社團資訊一覽 官方網頁",
    "category": "活動類",
    "description": "為臺大學務處課外活動輔導組網頁，載明正式登記運作的臺大社團，能一覽臺大社團多樣的風采。",
    "tags": [
      "官方",
      "社團",
      "總覽"
    ],
    "source": "",
    "url": "https://osa_activity.ntu.edu.tw/club/list/type/0"
  },
  {
    "id": 3,
    "title": "臺大海外教育資訊網",
    "category": "自我精進",
    "description": "我們的使命是讓同學在完成臺大學業的同時，擁有專屬的出國學習經驗，建立國際視野。包含交換計畫、訪問學生、雙聯學位、短期課程與海外實習等多元服務。",
    "tags": [
      "國際交流",
      "學術",
      "官方"
    ],
    "source": "",
    "url": "https://studyabroad.ntu.edu.tw/"
  },
  {
    "id": 4,
    "title": "堉璘臺大人才培育計畫",
    "category": "活動類",
    "description": "這是一個屬於改變者的行動實作計劃。串聯非營利組織（NPO）的真實需求，投入培育與實作資源，讓年輕人有機會成為擴大社會影響力的行動改變者。",
    "tags": [
      "專案",
      "社會影響力",
      "跨領域"
    ],
    "source": "",
    "url": "https://yllproject.ntu.edu.tw/"
  },
  {
    "id": 5,
    "title": "新生學習入門書院",
    "category": "活動類",
    "description": "新生書院是臺大為新生辦理一系列主題活動，從實境闖關、社團市集、學長姐講座到音樂祭，希望讓新生透過互動更認識。",
    "tags": [
      "官方",
      "新生",
      "社團"
    ],
    "source": "",
    "url": "https://www.instagram.com/ntuorientation?utm_source=ig_web_button_share_sheet&igsh=ZDNlZDc0MzIxNw=="
  },
  {
    "id": 6,
    "title": "臺大學生會",
    "category": "活動類",
    "description": "根據《國立臺灣大學學生會自治規程（學生憲章）》，台灣大學學生，為弘揚學術，追尋真理，塑造自由平等之社會，建設民主法治之國家，令本會為台灣大學代表全體學生之自治團體。",
    "tags": [
      "學生會",
      "校園民主",
      "社團"
    ],
    "source": "",
    "url": "https://www.facebook.com/NTUSAtw"
  },
  {
    "id": 7,
    "title": "GLO Taiwan 全球領袖組織臺灣分會",
    "category": "活動類",
    "description": "美式領導教育，透過領袖高峰會、創客松工作坊及演說強化坊，栽培為社會貢獻的青年領袖。",
    "tags": [
      "社群",
      "自我成長",
      "領導力"
    ],
    "source": "",
    "url": "https://www.instagram.com/glotaiwan/?hl=zh-tw"
  },
  {
    "id": 8,
    "title": "臺大外語教學暨資源中心",
    "category": "自我精進",
    "description": "定期舉辦英文系列講座、小聚、桌遊等活動，並提供線上自學課程平台。",
    "tags": [
      "國際交流",
      "官方",
      "語言學習"
    ],
    "source": "",
    "url": "https://www.instagram.com/ntufltc/?hl=zh-tw"
  },
  {
    "id": 9,
    "title": "聆森",
    "category": "自我精進",
    "description": "來自臺大的關注心理健康的學生團隊。\n在校園中，我們觀察到大學生在心理健康議題求助的歷程中常遇到「不知道何時求助、不敢求助、不易求助」的三不困境。\n因此我們選擇將關注付諸行動，期待透過培養同儕力量，共同孕育如森林般緊密而可持續的校園心理支持網絡。\n\n",
    "tags": [
      "心理健康",
      "社群",
      "自我成長"
    ],
    "source": "",
    "url": "https://www.instagram.com/listenntu/?hl=zh-tw"
  },
  {
    "id": 10,
    "title": "臺大寫作教學中心",
    "category": "自我精進",
    "description": "規劃及開設寫作教學課程，提升本校學生學術寫作及批判性分析思考能力。服務包含：Writing Together（研究生互助寫作）、寫作急診室（一對一學術寫作諮詢）、Writing with AI（AI 寫作諮詢），並有開設寫作相關課程。",
    "tags": [
      "學術",
      "官方",
      "語言學習"
    ],
    "source": "",
    "url": "https://awec.ntu.edu.tw/"
  },
  {
    "id": 11,
    "title": "全球集思論壇",
    "category": "活動類",
    "description": "全球集思論壇（GIS Taiwan）自 2008 年創立以來，是臺灣規模最大的國際學生學術論壇。在為期五天的論壇中，我們將邀請來自世界各地的學生代表，和產官學界領袖對話，聚焦國際議題、交流多元觀點，嘗試為全球挑戰提出解方。這不僅是一場思想激盪的盛會，也將會是跨領域、跨世代合作的實踐平台。",
    "tags": [
      "學術",
      "論壇",
      "跨領域"
    ],
    "source": "",
    "url": "https://linktr.ee/GISTaiwan2026?fbclid=PAZXh0bgNhZW0CMTEAc3J0YwZhcHBfaWQMMjU2MjgxMDQwNTU4CGNhbGxzaXRlAjE1AAGnr_jAUo6W_VNN19qIH83i0Rh2phxAfnazFmrypFveONrOuHheuwIbW4C2TmQ_aem_fCLg-oCXN_HE0OALeHsZiQ"
  },
  {
    "id": 12,
    "title": "小田野自主學習計畫",
    "category": "自我精進",
    "description": "旨在培養學生主動求知、探索自我、服務利他之精神。\n本計畫推動學生利用課餘時間啟動個人專屬的學習計畫，在執行計畫過程中透過參加學習聚會與同儕交換觀點與做法，並經由反思寫作檢核計畫執行進度，最後產出具利他性之計畫成果。同時，為鼓勵學生將學期間的自主學習成果持續深化，本計畫亦鼓勵學生利用暑假期間將學習計畫具體執行、落地實踐，藉此更深層建構個人學習態度、探索生命價值及生涯方向。",
    "tags": [
      "官方",
      "專案",
      "自我成長"
    ],
    "source": "",
    "url": "https://www.dlc.ntu.edu.tw/%e8%87%aa%e4%b8%bb%e5%ad%b8%e7%bf%92%e8%a8%88%e7%95%ab/"
  },
  {
    "id": 13,
    "title": "臺大雙語教育中心",
    "category": "自我精進",
    "description": "致力推動與串聯校內資源來促進雙語化學習跟全英語授課（EMI）。服務內容包含：一對一口說諮詢、Chatterbox Cafe、培力英檢及英語課程補助、專業英語課程、及英語學習護照（可獲得現金獎勵！）。",
    "tags": [
      "官方",
      "自我成長",
      "語言學習"
    ],
    "source": "",
    "url": "https://cbe.ntu.edu.tw/"
  },
  {
    "id": 14,
    "title": "臺大領域專長官方網頁",
    "category": "學業類",
    "description": "將課程重新模組化，有別於清單式課程規劃，且領域專長能彰顯各領域核心專長、新興發展方向、跨域創新趨勢。且經過系統自動審核，可獲得領域專長證書。",
    "tags": [
      "官方",
      "自我成長",
      "領域專長"
    ],
    "source": "",
    "url": "https://specom.aca.ntu.edu.tw/?lang=zh"
  },
  {
    "id": 15,
    "title": "設計思考教練人才培育課程",
    "category": "學業類",
    "description": "教練課帶領學員走過以人為本的三個層次：第一，以「使用者」為本，學員將知道如何透過設計思考解決使用者的問題；第二，以自己為本，學員將練習以設計思考同理個人需求，自我照顧；第三，以團隊為本，學員將透過大量團隊合作，練習同理夥伴，並作為團隊引導角色，帶領團隊前進。\n\n透過專案模組，修課學生除了獲得理論基礎的訓練外，也將能夠增進真實專案的引導技巧，該專案技巧，將能夠解決真實使用者問題，並與其他方法論交相輝映，應用在多元場域。此外，透過引導模組，修課學生也將具備更佳之團隊協作能力，成為推進團隊的良好引導者。",
    "tags": [
      "自我成長",
      "設計思考",
      "選課"
    ],
    "source": "",
    "url": "https://dschool.ntu.edu.tw/courses/ds5105/"
  },
  {
    "id": 16,
    "title": "實習透視鏡",
    "category": "職涯規劃",
    "description": "透明的實習經驗分享平台的討論區，有許多實習職缺都會在此刊登",
    "tags": [
      "實習",
      "社群",
      "總覽"
    ],
    "source": "",
    "url": "https://www.facebook.com/groups/internlens/?locale=zh_TW"
  },
  {
    "id": 17,
    "title": "設計你的人生 Design Your Life",
    "category": "學業類",
    "description": "「設計你的人生」課程以設計思考（Design Thinking）為基礎，將其精神融入人生設計的實驗中；鼓勵學員將自己視為自己人生中的「使用者」與「設計師」，從自己的角度出發，透過同理心了解自身需求，進而定義個人價值觀，並發想專屬於自己的解決方法；我們鼓勵學員勇敢跨出舒適圈，將腦海中的想法化為低門檻的行動，並在行動中覺察自我，透過迭代與反思，逐步展開自己新的人生選擇與方向。",
    "tags": [
      "自我成長",
      "設計思考",
      "選課"
    ],
    "source": "",
    "url": "https://dschool.ntu.edu.tw/courses/ds5210/"
  },
  {
    "id": 18,
    "title": "臺大學分學程官方網頁",
    "category": "學業類",
    "description": "學位學程是授予學位之跨系所專業的課程組合，學位學程跳脫傳統大學部學系的框架，進行跨域整合，擁有機動性、富有彈性與跨領域整合的特性。修習完會於畢業時獲得學位學程的證書，充分展示跨域長才！",
    "tags": [
      "學分學程",
      "官方",
      "自我成長"
    ],
    "source": "",
    "url": "https://ifsel3.aca.ntu.edu.tw/cou_stu/index.php"
  },
  {
    "id": 19,
    "title": "臺大校學士官方網頁",
    "category": "學業類",
    "description": "校學士適合有跨領域方向與目標的你，依自身興趣或生涯規劃，運用「領域專長」，自組修讀跨學院課程規劃，進行知識整合，\n打造專屬的學士學位。讓你開創不同領域視野，引發不同面向激盪，發揮學習的自主性，塑造未來的多元可能性。",
    "tags": [
      "官方",
      "自我成長",
      "跨領域"
    ],
    "source": "",
    "url": "https://ntuibpu.ntu.edu.tw/Default.html"
  },
  {
    "id": 20,
    "title": "臺大學輔中心",
    "category": "諮詢類",
    "description": "臺大學輔中心（Center for Student Well-Being）由學生事務處設立，致力於整合校內外資源、建立細緻的輔導網絡。中心提供心理諮商、個案管理、心理測驗、團體工作坊，以及生涯輔導與轉系／雙主修等規劃。學習資源方面，中心協助學科補救、一對一學習諮詢，並與系上合作提供導師與課業輔導。學輔專員（駐點於各學院）則負責學生諮詢與個案管理、協助連結校內資源、舉辦宣導講座或活動，並協助學生申請夢田深耕計畫等。這些服務特別適合在學習、校園適應、人際互動、壓力管理、生涯規劃等方面有需求的同學。",
    "tags": [
      "一對一",
      "學業輔導",
      "官方",
      "校園適應",
      "生涯規劃",
      "講座活動",
      "資源轉介"
    ],
    "source": "",
    "url": "https://csw.ntu.edu.tw/Default.html"
  },
  {
    "id": 21,
    "title": "Heptabase 筆記軟體",
    "category": "自我精進",
    "description": NaN,
    "tags": [
      "學習工具",
      "思維邏輯",
      "概念梳理",
      "筆記軟體"
    ],
    "source": "",
    "url": "https://app.heptabase.com/?invite-acc-id=ff79f8c8-4db4-437c-b69b-149257f8bea0"
  },
  {
    "id": 22,
    "title": "設計思考入門1T",
    "category": "學業類",
    "description": "設計思考入門為兩日設計思考工作坊，期望透過工作坊形式讓參與學員體驗設計思考五步驟如何解決問題。本課程分成兩部份，首先經由講演與實作練習，讓學生更深切了解設計思考的架構與本質。再經由嘗試解決生活週遭的實際問題，讓學生探索問題的來源，進而提出各種創新的設計方案，並且實際執行與驗證，體驗設計思考的重要步驟與精髓。課程將以集中且密集的方式進行，修課學生可使用 D-School 創新實作中心，讓創意可快速呈現並驗證，讓學生在不受限制的環境下發揮最大的創意且完成實作成果。\n\n",
    "tags": [
      "自我成長",
      "設計思考",
      "選課"
    ],
    "source": "",
    "url": "https://dschool.ntu.edu.tw/courses/ds5104/"
  },
  {
    "id": 23,
    "title": "臺大學習諮詢",
    "category": "諮詢類",
    "description": "為提昇本校學生的學習成效，並協助解決其基礎學科學習疑難，特甄選課業輔導小老師，提供定時定點的學習諮詢服務。 諮詢地點: 綜合教學館 學習開放空間    輔導科目: 微積分、統計學、普通物理   預約開放: 可以預約14天內的課程。",
    "tags": [
      "一對一",
      "免費",
      "學業輔導",
      "學術",
      "官方",
      "微積分",
      "普通物理",
      "統計學"
    ],
    "source": "",
    "url": "https://ntuacounseling.ntu.edu.tw/web/basic/service"
  },
  {
    "id": 24,
    "title": "獎學金資訊交流社群",
    "category": "生活類",
    "description": "希望給予大家一個互相討論和分享獎學金資訊和經驗的平台，讓獎學金的資訊更加流通，也讓對的人和對的機會相遇。在這個社群裡，你可以：📌提出對獎學金資訊、申請的疑問• 不用怕被當做伸手牌！這裡鼓勵任何提問，即便還沒完全做好事前功課，也可以上來提問）-📌分享獎學金相關資訊• 分享自己申請獎學金的經驗（申請名稱、申請的難易之處、當時準備申請的心路歷程⋯⋯）• 宣傳、分享近期獎學金的申請時程• 交流、討論各項獎學金申請的經驗-📌其他• 不限於以上內容！只要和獎學金相關的資訊都可以在社群中分享、討論，也歡迎大家把這個社群分享給身邊的親朋好友，讓獎學金的資訊可以更加流通。",
    "tags": [
      "獎學金",
      "社群",
      "經驗分享"
    ],
    "source": "",
    "url": "https://www.facebook.com/groups/1128189471834002/?locale=zh_TW"
  },
  {
    "id": 25,
    "title": "myNTU 校園服務整合平台",
    "category": "生活類",
    "description": NaN,
    "tags": [
      "整合",
      "更簡明的my NTU",
      "校園服務"
    ],
    "source": "",
    "url": "https://www.myntu.com.tw/"
  },
  {
    "id": 26,
    "title": "臺大學習規劃辦公室",
    "category": "諮詢類",
    "description": "2021年8月成立，設置於教務處下，借鏡國外「學術建議」(Academic Advising)經驗，以學生興趣與目標為本，幫助學生適性發展。 學習規劃辦公室作為學習路線與資源的調度站，不只協助學生善用校方資源，也召集多元背景的專家與同儕，透過持續的「對話」，引導學生進行修課規劃、累積未來所需知能。\n\n願景➝引導學生適才適性發展、提升未來人才價值\n目標➝建構臺大學習規劃制度、串聯校內校外資源\n策略➝協助學生探索生涯方向、搭配課程模組、發展成長路徑、追求自我實現",
    "tags": [
      "個人化建議",
      "免費",
      "學習規劃",
      "官方",
      "生涯規劃",
      "職涯探索",
      "自我探索",
      "領域專長"
    ],
    "source": "",
    "url": "https://aaoffice.ntu.edu.tw/"
  },
  {
    "id": 27,
    "title": "國際引水人實習計畫",
    "category": "職涯規劃",
    "description": "臺大校方提出的海外實習計劃。為此，臺大與海外企業及非營利組織合作，為臺大學生創造跨領域的國際實習機會，且本科生和研究生均可申請該計劃，參與海外實習計畫的學生將獲得國際事務處提供的生活津貼。該計劃將促進國際交流，拓展參與者的視野，並幫助他們成長為具有全球視野的專業人才。",
    "tags": [
      "國際交流",
      "實習",
      "自我成長"
    ],
    "source": "",
    "url": "https://internshipabroad.ntu.edu.tw/"
  },
  {
    "id": 28,
    "title": "Consensus 文獻搜尋、",
    "category": "nan",
    "description": NaN,
    "tags": [
      "nan"
    ],
    "source": "",
    "url": "https://consensus.app/"
  },
  {
    "id": 29,
    "title": "臺大心輔中心",
    "category": "諮詢類",
    "description": "臺大學生輔導中心於民國五十三年三月，為維護及增進本校學生的心理健康而設立。希望透過各種服務，幫助學生消除煩惱，建立健康、良好的生活態度與習慣，發揮內在潛力，過充實、愉快、有意義的精神生活。　　\n中心設有主任一人，本學年由臺大醫院精神醫學部簡意玲教授兼任，專任專業輔導員25人、兼任專業輔導員26人，具臨床心理師、諮商心理師、社會工作師或精神科醫師執照証照者達51人；均具國、內外心理學、心理諮商、教育輔導、社會工作、精神醫療碩學士學位或繼續攻讀博士學位，且臨床經驗豐富，其中並有11位輔導員可提供外籍生諮商輔導，落實校園國際化之相關服務。同時，為提升輔導員之專業輔導知能，中心聘請校內外資深專業人員等擔任個案研討會督導，以及本校附設醫院之精神科主治醫師提供醫療諮詢。　　此外，我們提供很多心理心靈相關書籍、期刊雜誌及漫畫等與同學分享，還有溫暖舒適的空間，歡迎同學多多利用，前來做做心理測驗、看書看報；這裡是個溫馨有愛的地方，歡迎經常光臨。\n\n",
    "tags": [
      "官方",
      "心理健康",
      "校園適應",
      "輔導"
    ],
    "source": "",
    "url": "https://scc_osa.ntu.edu.tw/Emergency"
  },
  {
    "id": 30,
    "title": "YouBike2.0 補助申請",
    "category": "生活類",
    "description": "為鼓勵本校學生騎乘YouBike2.0，補貼對象限本校大學部及碩博士學生（申請及領取補助金額時需具有效學籍），每學年第1學期報名期間為09月01日起至12月31日止，每學年第2學期報名期間為03月01日起至06月30日止  申。辦者騎乘YouBike2.0消費滿500元，將補貼100元學生證悠遊卡儲值金，每人一學期限補助一次，不得重複申請。  申辦者接獲總務處事務組通知騎乘消費滿500元後，請持有效學生證悠遊卡至行政大樓事務組辦公室或新南地下停車場、辛亥地下停車場、立體機車停車場等管理中心，臨櫃辦理儲值100元入申辦者學生證悠遊卡。\n",
    "tags": [
      "YouBike",
      "官方",
      "補助"
    ],
    "source": "",
    "url": "https://my.ntu.edu.tw/yb2sub/"
  }
];